SLS/src/Catalogs/jiraЗадачи/jiraЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>jiraЗадачи</name>
  <owners>Catalog.jiraСервера</owners>
  <attributes>
    <name>issueid</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.jiraПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.jiraПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>created</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>update</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>prior</name>
    <type>
      <types>EnumRef.JiraПриоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ITService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>type</name>
    <type>
      <types>CatalogRef.jiraТипыЗапросов</types>
    </type>
  </attributes>
</mdclass:Catalog>

SLS/src/InformationRegisters/jiraСписанноеВремяПоЗадаче/jiraСписанноеВремяПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>jiraСписанноеВремяПоЗадаче</name>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСтарта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>АвторОбновления</name>
    <type>
      <types>CatalogRef.jiraПользователи</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.jiraЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SLS/src/Catalogs/jiraЗадачи/Forms/ФормаСпискаУД/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	РаботыВЗадаче.Очистить();
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ДанныеТекущейСтроки = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
		ЗаполнитьРаботыВЗадаче(ДанныеТекущейСтроки.Ссылка);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРаботыВЗадаче(ЗадачаСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	jiraСписанноеВремяПоЗадаче.Задача КАК Задача,
	               |	jiraСписанноеВремяПоЗадаче.id КАК id,
	               |	jiraСписанноеВремяПоЗадаче.ДатаСоздания КАК ДатаСоздания,
	               |	jiraСписанноеВремяПоЗадаче.ДатаСтарта КАК ДатаСтарта,
	               |	jiraСписанноеВремяПоЗадаче.ДатаОбновления КАК ДатаОбновления,
	               |	jiraСписанноеВремяПоЗадаче.АвторОбновления КАК АвторОбновления,
	               |	jiraСписанноеВремяПоЗадаче.ВремяВСекундах КАК ВремяВСекундах,
	               |	jiraСписанноеВремяПоЗадаче.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.jiraСписанноеВремяПоЗадаче КАК jiraСписанноеВремяПоЗадаче
	               |ГДЕ
	               |	jiraСписанноеВремяПоЗадаче.Задача = &ЗадачаСсылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗадачаСсылка", ЗадачаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РаботыВЗадаче.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры
